tap "azure/kubelogin"
tap "databricks/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
brew "asdf"
brew "azure-cli"
brew "bottom"
brew "ccat"
brew "cmake"
brew "docker"
brew "docker-credential-helper"
brew "erdtree"
brew "exercism"
brew "ffmpeg"
brew "git-delta"
brew "go"
brew "hadolint"
brew "helix"
brew "helm"
brew "htop"
brew "httpie"
brew "hugo"
brew "jq"
brew "just"
brew "k9s"
brew "kubernetes-cli"
brew "libiconv"
brew "llvm"
brew "lsd"
brew "luarocks"
brew "neofetch"
brew "neovim"
brew "nushell"
brew "nvm"
brew "p7zip"
brew "pnpm"
brew "podman"
brew "podman-compose"
brew "poetry"
brew "ripgrep"
brew "rtx"
brew "shellcheck"
brew "starship"
brew "terraform"
brew "tflint"
brew "tfsec"
brew "tmux"
brew "unar"
brew "yarn"
brew "zellij"
brew "zoxide"
brew "azure/kubelogin/kubelogin"
brew "databricks/tap/databricks"
cask "alacritty"
cask "balenaetcher"
cask "caffeine"
cask "calibre"
cask "datweatherdoe"
cask "dbeaver-community"
cask "discord"
cask "eul"
cask "firefox"
cask "font-3270-nerd-font"
cask "font-agave-nerd-font"
cask "font-anonymice-nerd-font"
cask "font-arimo-nerd-font"
cask "font-aurulent-nerd-font"
cask "font-bigblue-terminal-nerd-font"
cask "font-bitstream-vera-sans-mono-nerd-font"
cask "font-blex-mono-nerd-font"
cask "font-caskaydia-cove-nerd-font"
cask "font-code-new-roman-nerd-font"
cask "font-cousine-nerd-font"
cask "font-daddy-time-mono-nerd-font"
cask "font-dejavu-sans-mono-nerd-font"
cask "font-droid-sans-mono-nerd-font"
cask "font-fantasque-sans-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-go-mono-nerd-font"
cask "font-gohufont-nerd-font"
cask "font-hack-nerd-font"
cask "font-hasklug-nerd-font"
cask "font-heavy-data-nerd-font"
cask "font-hurmit-nerd-font"
cask "font-im-writing-nerd-font"
cask "font-inconsolata-go-nerd-font"
cask "font-inconsolata-lgc-nerd-font"
cask "font-inconsolata-nerd-font"
cask "google-chrome"
cask "jetbrains-toolbox"
cask "kindle"
cask "kindle-comic-converter"
cask "lapce"
cask "microsoft-auto-update"
cask "microsoft-excel"
cask "microsoft-outlook"
cask "microsoft-teams"
cask "microsoft-word"
cask "ngrok"
cask "notion"
cask "openvpn-connect"
cask "pgadmin4"
cask "postman"
cask "powershell"
cask "qbittorrent"
cask "spotify"
cask "teamspeak-client"
cask "telegram-desktop"
cask "visual-studio-code"
cask "vlc"
cask "wezterm"
cask "zoom"
vscode "aaron-bond.better-comments"
vscode "akamud.vscode-theme-onedark"
vscode "AndersEAndersen.html-class-suggestions"
vscode "anteprimorac.html-end-tag-labels"
vscode "ardenivanov.svelte-intellisense"
vscode "arrterian.nix-env-selector"
vscode "astro-build.astro-vscode"
vscode "bbenoist.Nix"
vscode "BeardedBear.beardedicons"
vscode "bierner.emojisense"
vscode "bierner.markdown-mermaid"
vscode "bpruitt-goddard.mermaid-markdown-syntax-highlighting"
vscode "bradlc.vscode-tailwindcss"
vscode "bram209.leptos-language-server"
vscode "Catppuccin.catppuccin-vsc"
vscode "Catppuccin.catppuccin-vsc-icons"
vscode "charliermarsh.ruff"
vscode "christian-kohler.path-intellisense"
vscode "DavidAnson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "donjayamanne.vscode-jupytext"
vscode "DotJoshJohnson.xml"
vscode "dustypomerleau.rust-syntax"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "enkia.tokyo-night"
vscode "Equinusocio.vsc-community-material-theme"
vscode "Equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "exiasr.hadolint"
vscode "file-icons.file-icons"
vscode "formulahendry.auto-rename-tag"
vscode "foxundermoon.shell-format"
vscode "GitHub.copilot"
vscode "GitHub.copilot-chat"
vscode "github.vscode-github-actions"
vscode "GitHub.vscode-pull-request-github"
vscode "golang.go"
vscode "GregorBiswanger.json2ts"
vscode "Gruntfuggly.todo-tree"
vscode "hashicorp.hcl"
vscode "hashicorp.terraform"
vscode "hbenl.vscode-test-explorer"
vscode "hdevalke.rust-test-lens"
vscode "IronGeek.vscode-env"
vscode "kamikillerto.vscode-colorize"
vscode "kavod-io.vscode-jest-test-adapter"
vscode "KevinRose.vsc-python-indent"
vscode "lancewilhelm.horizon-extended"
vscode "littlefoxteam.vscode-python-test-adapter"
vscode "loiane.ts-extension-pack"
vscode "matangover.mypy"
vscode "mhutchie.git-graph"
vscode "ms-azuretools.vscode-docker"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-python.mypy-type-checker"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.makefile-tools"
vscode "ms-vscode.powershell"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vsliveshare.vsliveshare"
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-pg"
vscode "naumovs.color-highlight"
vscode "njpwerner.autodocstring"
vscode "njqdev.vscode-python-typehint"
vscode "oderwat.indent-rainbow"
vscode "plex.vscode-protolint"
vscode "pmneo.tsimporter"
vscode "qufiwefefwoyn.inline-sql-syntax"
vscode "qufiwefefwoyn.kanagawa"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-yaml"
vscode "rosshamish.kuskus-kusto-language-server"
vscode "rosshamish.kuskus-kusto-syntax-highlighting"
vscode "rust-lang.rust-analyzer"
vscode "sainnhe.edge"
vscode "samuelcolvin.jinjahtml"
vscode "serayuzgur.crates"
vscode "shalldie.background"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "SirTori.indenticator"
vscode "skellock.just"
vscode "streetsidesoftware.code-spell-checker"
vscode "stringham.move-ts"
vscode "svelte.svelte-vscode"
vscode "Swellaby.vscode-rust-test-adapter"
vscode "syler.sass-indented"
vscode "tal7aouy.icons"
vscode "tamasfe.even-better-toml"
vscode "teabyii.ayu"
vscode "TechTheAwesome.rust-yew"
vscode "timonwong.shellcheck"
vscode "usernamehw.errorlens"
vscode "vadimcn.vscode-lldb"
vscode "vscodevim.vim"
vscode "wayou.vscode-todo-highlight"
vscode "wholroyd.jinja"
vscode "wraith13.bracket-lens"
vscode "yinfei.luahelper"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
vscode "zh9528.file-size"
vscode "zhuangtongfa.material-theme"
vscode "zxh404.vscode-proto3"
