jorgebucaran/fisher
PatrickF1/fzf.fish
franciscolourenco/done
joseluisq/gitnow@2.10.0
andreiborisov/sponge
jorgebucaran/autopair.fish
acomagu/fish-async-prompt
jorgebucaran/nvm.fish
gazorby/fish-abbreviation-tips
h-matsuo/fish-color-scheme-switcher
edc/bass
