#Load oh my zsh library
ohmyzsh/ohmyzsh

#Load bundles from default repo (oh-my-zsh)
ohmyzsh/ohmyzsh path:plugins/git
ohmyzsh/ohmyzsh path:plugins/docker
ohmyzsh/ohmyzsh path:plugins/docker-compose
ohmyzsh/ohmyzsh path:plugins/npm
ohmyzsh/ohmyzsh path:plugins/nvm
ohmyzsh/ohmyzsh path:plugins/pip
ohmyzsh/ohmyzsh path:plugins/golang
ohmyzsh/ohmyzsh path:plugins/node
ohmyzsh/ohmyzsh path:plugins/tmux
ohmyzsh/ohmyzsh path:plugins/minikube
ohmyzsh/ohmyzsh path:plugins/aws
ohmyzsh/ohmyzsh path:plugins/terraform
ohmyzsh/ohmyzsh path:plugins/kubectl

# Load bundles from external repos
Aloxaf/fzf-tab
unixorn/fzf-zsh-plugin
zsh-users/zsh-completions
zsh-users/zsh-autosuggestions
zdharma-continuum/fast-syntax-highlighting
zpm-zsh/clipboard
zpm-zsh/material-colors
darvid/zsh-poetry
MichaelAquilina/zsh-you-should-use
TamCore/autoupdate-oh-my-zsh-plugins
cowboyd/zsh-rust
paulmelnikow/zsh-startup-timer
trystan2k/zsh-tab-title
mbenford/zsh-tmux-auto-title
RobertAudi/tsm
MenkeTechnologies/zsh-cargo-completion
lukechilds/zsh-better-npm-completion
redxtech/zsh-kitty
spwhitt/nix-zsh-completions
#themes

